RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_rtc.c
  if (HAL_RTC_STATE_READY == hrtc->State)
  {
    switch (CallbackID)
    {
      case HAL_RTC_ALARM_A_EVENT_CB_ID :
        /* Legacy weak AlarmAEventCallback */
        hrtc->AlarmAEventCallback = HAL_RTC_AlarmAEventCallback;
        break;

      case HAL_RTC_ALARM_B_EVENT_CB_ID :
        /* Legacy weak AlarmBEventCallback */
        hrtc->AlarmBEventCallback = HAL_RTCEx_AlarmBEventCallback;
        break;

      case HAL_RTC_TIMESTAMP_EVENT_CB_ID :
        /* Legacy weak TimeStampEventCallback */
        hrtc->TimeStampEventCallback = HAL_RTCEx_TimeStampEventCallback;
        break;

      case HAL_RTC_WAKEUPTIMER_EVENT_CB_ID :
        /* Legacy weak WakeUpTimerEventCallback */
        hrtc->WakeUpTimerEventCallback = HAL_RTCEx_WakeUpTimerEventCallback;
        break;

      case HAL_RTC_SSRU_EVENT_CB_ID :
        /* Legacy weak SSRUEventCallback */
        hrtc->SSRUEventCallback = HAL_RTCEx_SSRUEventCallback;
        break;

      case HAL_RTC_TAMPER1_EVENT_CB_ID :
        /* Legacy weak Tamper1EventCallback */
        hrtc->Tamper1EventCallback = HAL_RTCEx_Tamper1EventCallback;
        break;

      case HAL_RTC_TAMPER2_EVENT_CB_ID :
        /* Legacy weak Tamper2EventCallback */
        hrtc->Tamper2EventCallback = HAL_RTCEx_Tamper2EventCallback;
        break;

      case HAL_RTC_TAMPER3_EVENT_CB_ID :
        /* Legacy weak Tamper3EventCallback */
        hrtc->Tamper3EventCallback = HAL_RTCEx_Tamper3EventCallback;
        break;

      case HAL_RTC_TAMPER4_EVENT_CB_ID :
        /* Legacy weak Tamper4EventCallback */
        hrtc->Tamper4EventCallback = HAL_RTCEx_Tamper4EventCallback;
        break;

      case HAL_RTC_TAMPER5_EVENT_CB_ID :
        /* Legacy weak Tamper5EventCallback */
        hrtc->Tamper5EventCallback = HAL_RTCEx_Tamper5EventCallback;
        break;

      case HAL_RTC_TAMPER6_EVENT_CB_ID :
        /* Legacy weak Tamper6EventCallback */
        hrtc->Tamper6EventCallback = HAL_RTCEx_Tamper6EventCallback;
        break;

      case HAL_RTC_TAMPER7_EVENT_CB_ID :
        /* Legacy weak Tamper7EventCallback */
        hrtc->Tamper7EventCallback = HAL_RTCEx_Tamper7EventCallback;
        break;

      case HAL_RTC_TAMPER8_EVENT_CB_ID :
        /* Legacy weak Tamper8EventCallback */
        hrtc->Tamper8EventCallback = HAL_RTCEx_Tamper8EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER1_EVENT_CB_ID :
        /* Legacy weak InternalTamper1EventCallback */
        hrtc->InternalTamper1EventCallback = HAL_RTCEx_InternalTamper1EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER2_EVENT_CB_ID :
        /* Legacy weak InternalTamper2EventCallback */
        hrtc->InternalTamper2EventCallback = HAL_RTCEx_InternalTamper2EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER3_EVENT_CB_ID :
        /* Legacy weak InternalTamper3EventCallback */
        hrtc->InternalTamper3EventCallback = HAL_RTCEx_InternalTamper3EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER4_EVENT_CB_ID :
        /* Legacy weak InternalTamper4EventCallback */
        hrtc->InternalTamper4EventCallback = HAL_RTCEx_InternalTamper4EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER5_EVENT_CB_ID :
        /* Legacy weak InternalTamper5EventCallback */
        hrtc->InternalTamper5EventCallback = HAL_RTCEx_InternalTamper5EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER6_EVENT_CB_ID :
        /* Legacy weak InternalTamper6EventCallback */
        hrtc->InternalTamper6EventCallback = HAL_RTCEx_InternalTamper6EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER7_EVENT_CB_ID :
        /* Legacy weak InternalTamper7EventCallback */
        hrtc->InternalTamper7EventCallback = HAL_RTCEx_InternalTamper7EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER8_EVENT_CB_ID :
        /* Legacy weak InternalTamper8EventCallback */
        hrtc->InternalTamper8EventCallback = HAL_RTCEx_InternalTamper8EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER9_EVENT_CB_ID :
        /* Legacy weak InternalTamper9EventCallback */
        hrtc->InternalTamper9EventCallback = HAL_RTCEx_InternalTamper9EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER11_EVENT_CB_ID :
        /* Legacy weak InternalTamper11EventCallback */
        hrtc->InternalTamper11EventCallback = HAL_RTCEx_InternalTamper11EventCallback;
        break;

      case HAL_RTC_INTERNAL_TAMPER15_EVENT_CB_ID :
        /* Legacy weak InternalTamper15EventCallback */
        hrtc->InternalTamper15EventCallback = HAL_RTCEx_InternalTamper15EventCallback;
        break;

      case HAL_RTC_MSPINIT_CB_ID :
        hrtc->MspInitCallback = HAL_RTC_MspInit;
        break;

      case HAL_RTC_MSPDEINIT_CB_ID :
        hrtc->MspDeInitCallback = HAL_RTC_MspDeInit;
        break;

      default :
        /* Return error status */
        status = HAL_ERROR;
        break;
    }
  }
  else if (HAL_RTC_STATE_RESET == hrtc->State)
  {
    switch (CallbackID)
    {
      case HAL_RTC_MSPINIT_CB_ID :
        hrtc->MspInitCallback = HAL_RTC_MspInit;
        break;

      case HAL_RTC_MSPDEINIT_CB_ID :
        hrtc->MspDeInitCallback = HAL_RTC_MspDeInit;
        break;

      default :
        /* Return error status */
        status = HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Return error status */
    status = HAL_ERROR;
  }

  return status;
}
#endif /* USE_HAL_RTC_REGISTER_CALLBACKS */

/**
  * @brief  Initialize the RTC MSP.
  * @param  hrtc RTC handle
  * @retval None
  */
__weak void HAL_RTC_MspInit(RTC_HandleTypeDef *hrtc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hrtc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_RTC_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitialize the RTC MSP.
  * @param  hrtc RTC handle
  * @retval None
  */
__weak void HAL_RTC_MspDeInit(RTC_HandleTypeDef *hrtc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hrtc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_RTC_MspDeInit could be implemented in the user file
   */
}

/**
  * @}
  */

